{"pages":[],"posts":[{"title":"Hello World","text":"Welcome to Hexo! This is your very first post. Check documentation for more info. If you get any problems when using Hexo, you can find the answer in troubleshooting or you can ask me on GitHub. Quick StartCreate a new post1$ hexo new &quot;My New Post&quot; More info: Writing Run server1$ hexo server More info: Server Generate static files1$ hexo generate More info: Generating Deploy to remote sites1$ hexo deploy More info: Deployment 한글 아무거나","link":"/2021/10/28/hello-world/"},{"title":"1028","text":"확인용 텍스트hexo generatehexo deploy","link":"/2021/10/28/1028/"},{"title":"1028","text":"요약 node.js 설치후 git 설치(URL) PyCharm 설치 https://dschloe.github.io/settings/hexo_blog/ 참조 git add . -&gt; git commit -m “내용” -&gt; git push hexo server(필수X) -&gt; hexo generate hexo deploy 완료 (github 저장 명령어)","link":"/2021/10/28/github_blog/"},{"title":"1032","text":"https://pandas.pydata.org/docs/reference/index.html 판다스 튜토리얼https://numpy.org/doc/stable/user/c-info.beyond-basics.html 넘파이 튜토리얼 https://velog.io/@junsikchoi/%ED%8C%8C%EC%9D%B4%EC%8D%AC-%EA%B8%B0%EB%B3%B8-%EB%AC%B8%EB%B2%95-%EC%9A%94%EC%95%BD-%EC%A0%95%EB%A6%AC개인용 문법확인용","link":"/2021/11/02/1102/"},{"title":"1103","text":"import yfinance as yfimport matplotlib.pyplot as plt data = yf.download(‘AAPL’, ‘2019-08-01’, ‘2020-08-01’)ts = data[‘Open’]fig, ax = plt.subplots(figsize=(10, 6)) 파이썬 명령작성문 연습내장 데이터문plt 현재 사용 X ax 위주로 연습 산점도두개의 연속형 변수를 표현하는데 사용 import matplotlib.pyplot as pltimport seaborn as sns fig, ax = plt.subplots(figsize=(10, 6))ax.scatter(x, y)ax.set_xlabel(‘A’)ax.set_ylabel(‘B’)ax.set_title(‘A ~ B’) fig.show() 박스플롯x축 변수: 범주형 변수, 그룹과 관련있는 변수, 문자열 y축 변수: 수치형 변수 import matplotlib.pyplot as pltimport seaborn as sns iris = sns.load_dataset(‘iris’) data = [iris[iris[‘species’]==”setosa”][‘petal_width’], iris[iris[‘species’]==”versicolor”][‘petal_width’], iris[iris[‘species’]==”virginica”][‘petal_width’]] fig, ax = plt.subplots(figsize=(10, 6))ax.boxplot(data, labels=[‘1’, ‘2’, ‘3’]) fig.show() 박스플롯 학습과정 블로그https://dschloe.github.io/python/python_edu/03_datavisualisation/ch_boxplot/ https://pbj0812.tistory.com/477 박스플롯 끝 추가 학습용 기초학습자 링크 https://wikidocs.net/85","link":"/2021/11/02/1103/"},{"title":"1104","text":"참조문서https://www.youtube.com/watch?v=n0p0120Gxqk (영상 설명)https://wooono.tistory.com/104 (정리 노트)https://scikit-learn.org/stable/modules/tree.html#regression (영문 논문 번역기 사용) 디시전 트리(Decision Tree) 일련의 분류 규칙을 통해 데이터를 분류, 회귀하는 지도 학습 모델 중 하나이며,결과 모델이 Tree 구조를 가지고 있기 때문에 Decision Tree라는 이름을 가짐 불순도 (Impurity) 복잡성을 의미하며, 해당 범주 안에 서로 다른 데이터가 얼마나 섞여 있는지를 뜻함다양한 개체들이 섞여 있을수록 불순도가 높아짐 분기기준 설정 시 현재노드의 불순도에 비해 자식노드의 불순도가 감소되도록 설정해야하며현재 노드의 불순도와 자식노드의 불순도 차이를 Information Gain(정보 획득)이라고 함 장점데이터의 전처리 (정규화, 결측치, 이상치 등) 를 하지 않아도 된다.수치형과 범주형 변수를 한꺼번에 다룰 수 있다. 단점만약 샘플의 사이즈가 크면 효율성 및 가독성이 떨어진다.과적합으로 알고리즘 성능이 떨어질 수 있다.한 번에 하나의 변수만을 고려하므로 변수간 상호작용을 파악하기가 어렵다.약간의 차이에 따라 (레코드의 개수의 약간의 차이) 트리의 모양이 많이 달라질 수 있다.두 변수가 비슷한 수준의 정보력을 갖는다고 했을 때, 약간의 차이에 의해 다른 변수가 선택되면 이 후의 트리 구성이 크게 달라질 수 있다.","link":"/2021/11/04/1104/"},{"title":"1109","text":"“”” 피규어 모형: funnel_area 깔때기형 차트, 데이터프레임 Q6 불러오기 및 (index)값 출력, [배열순서 1번행부터 시작],피규어 모형: funnel_area 깔때기형 차트, 데이터프레임 Q6 불러오기 및 (values)값 출력, [배열순서 1번행부터 시작], 제목 ‘Coding Experince’ “”” 모형 업데이트: 모형 지정, 색 한칸당 -1 단계씩 변하도록 변경모형 작동#데이터프레임 파이썬 Q7_Part_1 불러오기#데이터프레임 R Q7_Part_2 불러오기 #피규어 생성, 바 이름: 파이썬, x축 파이썬 데이터프레임에 Q1 불러오기, index 고유값 출력#y축 파이썬 데이터프레임에 Q1 불러오기, values 고유값 출력#마커색 2번 (하늘색) #바 이름: R, x축 R 데이터프레임에 Q1 불러오기, index 고유값 출력#y축 R 데이터프레임에 Q1 불러오기, values 고유값 출력#마커색 3번 (파랑색) 그래프 그룹형, 피규어 타이틀 ‘Kagglers using Python and R on regular basis by Age’, X축 소제목 ‘Age’, Y축 소제목 ‘Counts’#피규어 작동 참조자료 value_counts(): https://re-thought.com/pandas-value_counts/ .values —&gt;https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.values.html?highlight=values#pandas.DataFrame.values.index–&gt;https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.Index.html?highlight=index#pandas.Indexfunnel_area: https://docs.elixirtech.com/Ambience/2020/dashboards/designer/views/funnelAreaChart.htmlupdate_traces: https://plotly.com/python/creating-and-updating-figures/plotly: https://plotly.com/python/creating-and-updating-figures/ 분석 피규어","link":"/2021/11/09/1109/"},{"title":"1111","text":"주제 결정: How popular is kaggle in china vs japan? 하위주제 Q1 당신의 나이는 몇 살입니까?Q2 당신의 성별은 무엇입니까?Q3 현재 어느 나라에 거주하고 계십니까?Q4 당신이 얻었거나 향후 2년 안에 얻을 계획인 가장 높은 수준의 정규 교육은 무엇입니까?Q5 현재 역할과 가장 유사한 제목(또는 은퇴한 경우 가장 최근의 제목)을 선택합니다.Q6 코드 및/또는 프로그래밍을 몇 년 동안 작성했습니까?Q7 당신은 어떤 프로그래밍 언어를 정기적으로 사용합니까? (해당 항목 모두 선택)Q8 데이터 과학자에게 가장 먼저 배울 프로그래밍 언어를 추천해 주시겠습니까?Q9 다음 통합 개발 환경(IDE) 중 정기적으로 사용하는 환경은 무엇입니까? (해당 항목 모두 선택)Q10 다음 호스트 노트북 제품 중 정기적으로 사용하는 제품은 무엇입니까? (해당 항목 모두 선택)Q11 데이터 과학 프로젝트에 가장 자주 사용하는 컴퓨팅 플랫폼은 무엇입니까?Q12 정기적으로 사용하는 특수 하드웨어 유형은 무엇입니까? (해당 항목 모두 선택)Q13 TPU(텐서 처리 장치)를 대략 몇 번 사용했습니까?Q14 정기적으로 사용하는 데이터 시각화 라이브러리 또는 툴은 무엇입니까? (해당 항목 모두 선택)Q15 몇 년 동안 기계 학습 방법을 사용했습니까?Q16 다음 중 정기적으로 사용하는 기계 학습 프레임워크는 무엇입니까? (해당 항목 모두 선택)Q17 다음 중 정기적으로 사용하는 ML 알고리즘은 무엇입니까? (해당 항목 모두 선택):Q18 당신이 정기적으로 사용하는 컴퓨터 비전 방법은 무엇입니까? (해당 항목 모두 선택)1Q19 다음 중 정기적으로 사용하는 자연어 처리(NLP) 방법은 무엇입니까? (해당 항목 모두 선택)22 질문 19(특정 ML 방법)는 질문 17(알고리즘 범주)에 대한 관련 답변 선택을 선택한 응답자에게만 질문되었다. 1 질문 18(특정 ML 방법)은 질문 17(알고리즘 범주)에 대한 관련 답변 선택을 선택한 응답자에게만 질문되었다.Q20 현재 고용주/계약(또는 퇴직한 경우 가장 최근의 고용주)은 어떤 업종입니까?Q21 당신이 고용된 회사의 규모는 얼마나 됩니까?Q22 귀사에서 데이터 과학 워크로드를 담당하는 개인은 대략 몇 명입니까?Q23 귀사의 현재 고용주는 기계 학습 방법을 비즈니스에 통합하고 있습니까?Q24 업무에서 중요한 역할을 하는 활동을 선택합니다. (해당 항목 모두 선택) Q25 현재 연간 보상액(약 $USD)은 얼마입니까? [값 목록]Q26 지난 5년 동안 귀하(또는 귀하의 팀)는 가정(또는 직장)에서 머신러닝 및/또는 클라우드 컴퓨팅 서비스에 약 얼마의 비용을 지출했습니까?Q27-A 다음 중 정기적으로 사용하고 있는 클라우드 컴퓨팅 플랫폼은 무엇입니까? (해당 항목 모두 선택)Q28 익숙한 클라우드 플랫폼 중 가장 좋은 개발자 경험(가장 즐겁게 사용)을(를)3Q29-A 다음 클라우드 컴퓨팅 제품 중 하나를 정기적으로 사용하십니까? (해당 항목 모두 선택)4Q30-A 다음 데이터 스토리지 제품 중 하나를 정기적으로 사용하십니까? (해당 항목 모두 선택)5 5 질문 30-A(특정 AWS/Azure/GCP 제품)는 질문 27-A(다음 회사 중 어느 회사)에 대해 관련 답변 선택을 한 응답자에게만 질문되었다. 4 질문 29-A(특정 AWS/Azure/GCP 제품)는 질문 27-A(다음 회사 중 어느 회사)에 대한 관련 답변 선택을 한 응답자에게만 질문되었다. 3 질문 28(특정 제품)은 질문 27-A(다음 제품 중 어느 제품)에 대해 둘 이상의 선택을 한 응답자에게만 질문되었다.Q31-A 다음과 같은 관리되는 기계 학습 제품을 정기적으로 사용하십니까? (해당 항목 모두 선택)Q32-A 다음 빅데이터 제품(관계형 데이터베이스, 데이터 웨어하우스, 데이터 호수 등) 중 정기적으로 사용하는 제품은 무엇입니까? (해당 항목 모두 선택)Q33 다음 빅데이터 제품(관계형 데이터베이스, 데이터 웨어하우스, 데이터 호수 등) 중 가장 많이 사용하는 제품은 무엇입니까?66 질문 33(특정 제품)은 질문 32-A(다음 제품 중 어느 제품)에 대해 둘 이상의 선택을 한 응답자에게만 질문되었다. Q34-A 다음 중 정기적으로 사용하는 비즈니스 인텔리전스 툴은 무엇입니까? (해당 항목 모두 선택)Q35 다음 중 가장 자주 사용하는 비즈니스 인텔리전스 툴은 무엇입니까?77 질문 35(특정 제품)는 질문 34-A(다음 제품 중 어느 제품)에 대해 둘 이상의 선택을 한 응답자에게만 질문되었다. Q36-A 정기적으로 자동화된 기계 학습 도구(또는 부분 AutoML 도구)를 사용하십니까? (해당 항목 모두 선택)Q37-A 다음 자동 기계 학습 도구(또는 부분 AutoML 도구) 중 정기적으로 사용하는 도구는 무엇입니까? (해당 항목 모두 선택)8Q38-A 기계 학습 실험을 관리하는 데 도움이 되는 도구를 사용하십니까?8 질문 37-A(특정 제품)는 질문 36-A(다음 제품 범주 중 어느 범주)에 대해 긍정적인 답변을 한 응답자에게만 질문되었다.Q39 데이터 분석 또는 머신러닝 애플리케이션을 공개적으로 공유하거나 배포하는 곳은 어디입니까? (해당 항목 모두 선택)Q40 어떤 플랫폼에서 데이터 과학 과정을 시작했거나 완료했습니까? (해당 항목 모두 선택)Q41 직장이나 학교에서 데이터를 분석하기 위해 사용하는 주요 도구는 무엇입니까? (텍스트 응답 포함)Q42 데이터 과학 주제에 대해 보도하는 언론 매체는 누구/어떤 것이 좋습니까? (해당 항목 모두 선택) 최종 토의 결과 1, 2, 6, 7, 9, 11, 14번 문항 포트폴리오 문항 작성, 캐글 대회 분석 및 방향성 논의","link":"/2021/11/11/1110/"}],"tags":[{"name":"Python","slug":"Python","link":"/tags/Python/"}],"categories":[]}